# Rebar Create From Curves(Document, Rebar Style, Rebar Bar Type, Element, XYZ, IList Curve , Bar Terminations Data, Boolean, Boolean) Method

Source: https://www.revitapidocs.com/2026/46457aef-7ff3-e133-2ce1-cf143a66e65b.htm

---

| Rebar Create From Curves(Document, Rebar Style, Rebar Bar Type, Element, XYZ, IList Curve , Bar Terminations Data, Boolean, Boolean) Method |
| --- |

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static Rebar CreateFromCurves(
	Document doc,
	RebarStyle style,
	RebarBarType barType,
	Element host,
	XYZ norm,
	IList<Curve> curves,
	BarTerminationsData barTerminationsData,
	bool useExistingShapeIfPossible,
	bool createNewShape
)
```

```
Public Shared Function CreateFromCurves (
	doc As Document,
	style As RebarStyle,
	barType As RebarBarType,
	host As Element,
	norm As XYZ,
	curves As IList(Of Curve),
	barTerminationsData As BarTerminationsData,
	useExistingShapeIfPossible As Boolean,
	createNewShape As Boolean
) As Rebar
```

```
public:
static Rebar^ CreateFromCurves(
	Document^ doc,
	RebarStyle style,
	RebarBarType^ barType,
	Element^ host,
	XYZ^ norm,
	IList<Curve^>^ curves,
	BarTerminationsData^ barTerminationsData,
	bool useExistingShapeIfPossible,
	bool createNewShape
)
```

```
static member CreateFromCurves :
        doc : Document *
        style : RebarStyle *
        barType : RebarBarType *
        host : Element *
        norm : XYZ *
        curves : IList<Curve> *
        barTerminationsData : BarTerminationsData *
        useExistingShapeIfPossible : bool *
        createNewShape : bool -> Rebar
```

#### Parameters

doc Document
style RebarStyle
barType RebarBarType
host Element
norm XYZ
curves IList Curve
barTerminationsData BarTerminationsData
useExistingShapeIfPossible Boolean
createNewShape Boolean

#### Return Value

Rebar See Also

#### Reference

Rebar Class CreateFromCurves Overload Autodesk.Revit.DB.Structure Namespace